<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />



  <meta name="google-site-verification" content="4Fw5av3MAK9VoBQQanNGeiDwK9jEJjQBL6jk3PSY-B4" />










  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="编程,重构,代码结构," />





  <link rel="alternate" href="/atom.xml" title="Mengqi's blog" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.png?v=5.0.1" />






<meta name="description" content="这篇我们放下数学公式，来聊聊编程。“编程”这个概念如今在中国已经不再陌生，几乎各个高校都有自己的计算机学院，各种各样的培训班也是层出不穷。然而大家也都知道入门容易，精通很难。如果一个学习编程的人没能培养出这个领域所需要的良好思维习惯，而只是蜻蜓点水一般记住了一些基础的语法，概念，那么就很难对编程有更深入的理解。所以有必要介绍一些基本的，却容易被忽略的编程习惯。
复杂度程序员的天敌是复杂度。从小的方">
<meta property="og:type" content="article">
<meta property="og:title" content="愿望思维">
<meta property="og:url" content="http://mengqi92.github.io/2016/06/23/wishful-thinking/index.html">
<meta property="og:site_name" content="Mengqi's blog">
<meta property="og:description" content="这篇我们放下数学公式，来聊聊编程。“编程”这个概念如今在中国已经不再陌生，几乎各个高校都有自己的计算机学院，各种各样的培训班也是层出不穷。然而大家也都知道入门容易，精通很难。如果一个学习编程的人没能培养出这个领域所需要的良好思维习惯，而只是蜻蜓点水一般记住了一些基础的语法，概念，那么就很难对编程有更深入的理解。所以有必要介绍一些基本的，却容易被忽略的编程习惯。
复杂度程序员的天敌是复杂度。从小的方">
<meta property="og:image" content="http://mengqi92.github.io/2016/06/23/wishful-thinking/puzzle.jpg">
<meta property="og:updated_time" content="2016-06-23T15:37:38.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="愿望思维">
<meta name="twitter:description" content="这篇我们放下数学公式，来聊聊编程。“编程”这个概念如今在中国已经不再陌生，几乎各个高校都有自己的计算机学院，各种各样的培训班也是层出不穷。然而大家也都知道入门容易，精通很难。如果一个学习编程的人没能培养出这个领域所需要的良好思维习惯，而只是蜻蜓点水一般记住了一些基础的语法，概念，那么就很难对编程有更深入的理解。所以有必要介绍一些基本的，却容易被忽略的编程习惯。
复杂度程序员的天敌是复杂度。从小的方">
<meta name="twitter:image" content="http://mengqi92.github.io/2016/06/23/wishful-thinking/puzzle.jpg">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"always"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 12217047,
      author: '博主'
    }
  };
</script>




  <title> 愿望思维 | Mengqi's blog </title><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  


<!-- hexo-inject:begin --><!-- hexo-inject:end --><script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-68396368-1', 'auto');
  ga('send', 'pageview');
</script>


  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?8800f71adfa983d80f6c943ceb1ee330";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Mengqi's blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">a paranoid android.</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                愿望思维
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-06-23T15:32:58+08:00" content="2016-06-23">
              2016-06-23
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/programming/" itemprop="url" rel="index">
                    <span itemprop="name">编程</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/06/23/wishful-thinking/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/06/23/wishful-thinking/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x8FD9;&#x7BC7;&#x6211;&#x4EEC;&#x653E;&#x4E0B;&#x6570;&#x5B66;&#x516C;&#x5F0F;&#xFF0C;&#x6765;&#x804A;&#x804A;&#x7F16;&#x7A0B;&#x3002;&#x201C;&#x7F16;&#x7A0B;&#x201D;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x5982;&#x4ECA;&#x5728;&#x4E2D;&#x56FD;&#x5DF2;&#x7ECF;&#x4E0D;&#x518D;&#x964C;&#x751F;&#xFF0C;&#x51E0;&#x4E4E;&#x5404;&#x4E2A;&#x9AD8;&#x6821;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5B66;&#x9662;&#xFF0C;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x57F9;&#x8BAD;&#x73ED;&#x4E5F;&#x662F;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#x3002;&#x7136;&#x800C;&#x5927;&#x5BB6;&#x4E5F;&#x90FD;&#x77E5;&#x9053;&#x5165;&#x95E8;&#x5BB9;&#x6613;&#xFF0C;&#x7CBE;&#x901A;&#x5F88;&#x96BE;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x7684;&#x4EBA;&#x6CA1;&#x80FD;&#x57F9;&#x517B;&#x51FA;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x6240;&#x9700;&#x8981;&#x7684;&#x826F;&#x597D;&#x601D;&#x7EF4;&#x4E60;&#x60EF;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x873B;&#x8713;&#x70B9;&#x6C34;&#x4E00;&#x822C;&#x8BB0;&#x4F4F;&#x4E86;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x6982;&#x5FF5;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5F88;&#x96BE;&#x5BF9;&#x7F16;&#x7A0B;&#x6709;&#x66F4;&#x6DF1;&#x5165;&#x7684;&#x7406;&#x89E3;&#x3002;&#x6240;&#x4EE5;&#x6709;&#x5FC5;&#x8981;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#xFF0C;&#x5374;&#x5BB9;&#x6613;&#x88AB;&#x5FFD;&#x7565;&#x7684;&#x7F16;&#x7A0B;&#x4E60;&#x60EF;&#x3002;</p>
<h1 id="&#x590D;&#x6742;&#x5EA6;"><a href="#&#x590D;&#x6742;&#x5EA6;" class="headerlink" title="&#x590D;&#x6742;&#x5EA6;"></a>&#x590D;&#x6742;&#x5EA6;</h1><p>&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x5929;&#x654C;&#x662F;&#x590D;&#x6742;&#x5EA6;&#x3002;&#x4ECE;&#x5C0F;&#x7684;&#x65B9;&#x9762;&#x770B;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x9762;&#x5BF9;&#x7B97;&#x6CD5;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x5373;&#x5982;&#x4F55;&#x7528;&#x5C3D;&#x91CF;&#x5C11;&#x7684;&#x5F00;&#x9500;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#xFF1B;&#x4ECE;&#x5927;&#x7684;&#x65B9;&#x9762;&#x770B;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x9762;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x5373;&#x5982;&#x4F55;&#x5C06;&#x4E00;&#x4E2A;&#x73B0;&#x5B9E;&#x4E2D;&#x7684;&#x590D;&#x6742;&#x95EE;&#x9898;&#x7528;&#x5404;&#x79CD;&#x8BA1;&#x7B97;&#x6A21;&#x5757;&#x76F8;&#x4E92;&#x642D;&#x914D;&#xFF0C;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x6765;&#x89E3;&#x51B3;&#x3002;&#x5982;&#x4F55;&#x63A7;&#x5236;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x7684;&#x70ED;&#x70B9;&#x8BDD;&#x9898;&#x3002;</p>
<p>&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x89E3;&#x51B3;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x51E0;&#x4E2A;&#x6B66;&#x5668;&#xFF1A;&#x62BD;&#x8C61;&#x3001;&#x6A21;&#x5757;&#x5316;&#x3001;&#x89E3;&#x8026;&#x5408;&#x7B49;&#x7B49;&#xFF0C;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x4ECB;&#x7ECD;&#x540C;&#x6837;&#x597D;&#x7528;&#x7684;&#x6B66;&#x5668;&#xFF1A;&#x613F;&#x671B;&#x601D;&#x7EF4;&#x3002;</p>
<a id="more"></a>
<h1 id="&#x613F;&#x671B;&#x601D;&#x7EF4;"><a href="#&#x613F;&#x671B;&#x601D;&#x7EF4;" class="headerlink" title="&#x613F;&#x671B;&#x601D;&#x7EF4;"></a>&#x613F;&#x671B;&#x601D;&#x7EF4;</h1><img src="/2016/06/23/wishful-thinking/puzzle.jpg" alt="puzzle.jpg" title="">
<blockquote>
<p>&#x8981;&#x628A;&#x5927;&#x8C61;&#x88C5;&#x51B0;&#x7BB1;&#xFF0C;&#x603B;&#x5171;&#x5206;&#x51E0;&#x6B65;&#xFF1F;</p>
</blockquote>
<p>&#x67D0;&#x5E74;&#x6625;&#x665A;&#x5C0F;&#x54C1;&#x91CC;&#xFF0C;&#x5B8B;&#x4E39;&#x4E39;&#x63D0;&#x51FA;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x4E00;&#x5F00;&#x59CB;&#x542C;&#x5F97;&#x65F6;&#x5019;&#x6211;&#x50CF;&#x5C0F;&#x54C1;&#x91CC;&#x7684;&#x8D75;&#x672C;&#x5C71;&#x4E00;&#x6837;&#x4E5F;&#x662F;&#x6478;&#x4E0D;&#x7740;&#x5934;&#x8111;&#xFF0C;&#x8FD9;&#x5C31;&#x597D;&#x50CF;&#x6211;&#x4EEC;&#x62FF;&#x5230;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x9700;&#x6C42;&#xFF0C;&#x5BF9;&#x65B9;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5B8F;&#x5927;&#x7684;&#x613F;&#x666F;&#xFF0C;&#x7136;&#x800C;&#x4F5C;&#x4E3A;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x8005;&#x7684;&#x6211;&#x4EEC;&#xFF0C;&#x5374;&#x53D1;&#x73B0;&#x4E0D;&#x77E5;&#x9053;&#x4ECE;&#x54EA;&#x91CC;&#x5F00;&#x59CB;&#x3002;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5341;&#x5206;&#x5E38;&#x89C1;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5F53;&#x4F60;&#x8FD8;&#x5904;&#x5728;&#x5B66;&#x4E60;&#x9636;&#x6BB5;&#xFF0C;&#x8FD8;&#x4E0D;&#x80FD;&#x8FBE;&#x5230;&#x719F;&#x7EC3;&#x5E94;&#x7528;&#x6280;&#x80FD;&#x7684;&#x5730;&#x6B65;&#xFF0C;&#x9762;&#x5BF9;&#x4E00;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x5341;&#x5206;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5F80;&#x5F80;&#x65E0;&#x4ECE;&#x4E0B;&#x624B;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4E0D;&#x59A8;&#x653E;&#x8F7B;&#x677E;&#xFF0C;&#x5148;&#x4E0D;&#x53BB;&#x8003;&#x8651;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x800C;&#x662F;&#x7AD9;&#x5728;&#x4E00;&#x5B9A;&#x9AD8;&#x5EA6;&#xFF0C;&#x628A;&#x4EFB;&#x52A1;&#x5206;&#x89E3;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x9996;&#x5148;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x628A;&#x5927;&#x8C61;&#x88C5;&#x51B0;&#x7BB1;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x540D;&#x5B57;&#x5C31;&#x53EB;&#x505A; <code>packaging</code>&#xFF0C;&#x63A5;&#x53D7;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#x5927;&#x8C61;<code>elephant</code>&#x548C;<code>&#x51B0;&#x7BB1;</code>&#xFF1A;</p>
<figure class="highlight python"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line"><span class="function"><span class="keyword">def</span> <span class="title">packaging</span><span class="params">(elephant, refridgerator)</span>:</span></span><br><span class="line">    <span class="keyword">pass</span></span><br></pre></td></tr></table></figure>
<p>&#x7136;&#x540E;&#x5B8C;&#x5168;&#x4E0D;&#x8003;&#x8651;&#x7EC6;&#x8282;&#x5730;&#x628A;&#x4EFB;&#x52A1;&#x5206;&#x89E3;&#x4E3A;&#x4E09;&#x5927;&#x6B65;&#xFF1A;</p>
<ol>
<li>&#x628A;&#x51B0;&#x7BB1;&#x95E8;&#x6253;&#x5F00;</li>
<li>&#x628A;&#x5927;&#x8C61;&#x88C5;&#x8FDB;&#x53BB;</li>
<li>&#x628A;&#x51B0;&#x7BB1;&#x95E8;&#x5E26;&#x4E0A;</li>
</ol>
<p>&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x51FD;&#x6570;&#x53D8;&#x6210;&#x4E86;&#xFF1A;</p>
<figure class="highlight python"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"><span class="function"><span class="keyword">def</span> <span class="title">packaging</span><span class="params">(elephant, refridgerator)</span>:</span></span><br><span class="line">    refridgerator.open()</span><br><span class="line">    refridgerator.load(elephant)</span><br><span class="line">    refridgerator.close()</span><br></pre></td></tr></table></figure>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x4E09;&#x4E2A;&#x51FD;&#x6570;&#x8FD9;&#x65F6;&#x4E0D;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x5047;&#x8BBE;&#xFF08;&#x201C;&#x5E0C;&#x671B;&#x201D;&#xFF09;&#x5B83;&#x4EEC;&#x5DF2;&#x7ECF;&#x88AB;&#x5B9A;&#x4E49;&#x5E76;&#x5B9E;&#x73B0;&#x3002;&#x81F3;&#x4E8E;&#x8FD9;&#x4E09;&#x4E2A;&#x51FD;&#x6570;&#x5230;&#x5E95;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x3001;&#x7531;&#x8C01;&#x5B9E;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x5FC3;&#x3002;&#x6BD4;&#x5982;&#xFF0C;<code>fridgerator.open()</code> &#x53EF;&#x80FD;&#x662F;&#x672A;&#x6765;&#x7684;&#x6211;&#x6216;&#x8005;&#x662F;&#x9694;&#x58C1;&#x7684;&#x5C0F;&#x738B;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x6211;&#x53EA;&#x8981;&#x5E0C;&#x671B;&#x4ED6;&#x80FD;&#x5B9E;&#x73B0;&#x6211;&#x60F3;&#x8981;&#x7684;&#x529F;&#x80FD;&#x5C31;&#x884C;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x89E3;&#x51B3;&#x6574;&#x4F53;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x5173;&#x5FC3;&#x9AA8;&#x67B6;&#xFF0C;&#x4E0D;&#x5FC5;&#x8D39;&#x5FC3;&#x8003;&#x8651;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x3002;&#x800C;&#x5728;&#x8003;&#x8651;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x65F6;&#xFF08;&#x6BD4;&#x5982;&#x6211;&#x5F00;&#x59CB;&#x5B9E;&#x73B0; <code>fridgerator.open()</code>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#x57DF;&#x5DF2;&#x7ECF;&#x7F29;&#x5C0F;&#xFF0C;&#x6211;&#x5728;&#x5B9E;&#x73B0; <code>fridgerator.open()</code> &#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x5FC5;&#x8003;&#x8651;&#x5927;&#x8C61;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x5C31;&#x66F4;&#x80FD;&#x591F;&#x4E13;&#x6CE8;&#xFF0C;&#x5E76;&#x6709;&#x673A;&#x4F1A;&#x5199;&#x51FA;&#x66F4;&#x4E3A;&#x666E;&#x9002;&#x7684;&#x4EE3;&#x7801;&#xFF08;&#x6BD4;&#x5982;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x88C5;&#x8F7D;&#x4EFB;&#x610F;&#x9646;&#x5730;&#x52A8;&#x7269;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x975E;&#x53EA;&#x662F;&#x88C5;&#x8F7D;&#x5927;&#x8C61;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x201C;&#x613F;&#x671B;&#x601D;&#x7EF4;&#x201D;&#x7684;&#x6838;&#x5FC3;&#x3002;&#x501F;&#x52A9;&#x201C;&#x613F;&#x671B;&#x601D;&#x7EF4;&#x201D;&#xFF0C;&#x4E0D;&#x4EC5;&#x80FD;&#x8BA9;&#x6211;&#x4EEC;&#x4ECE;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x4E2D;&#x89E3;&#x8131;&#x51FA;&#x6765;&#xFF0C;&#x4ECE;&#x5927;&#x5C40;&#x89D2;&#x5EA6;&#x601D;&#x8003;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5199;&#x51FA;&#x826F;&#x597D;&#x7ED3;&#x6784;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5728;&#x7F16;&#x7801;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x4E86;&#x95EE;&#x9898;&#x57DF;&#x7684;&#x5212;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x6BD4;&#x8F83;&#x4E13;&#x6CE8;&#xFF0C;&#x4FDD;&#x6301;&#x6E05;&#x6670;&#x7684;&#x601D;&#x8DEF;&#xFF1B;&#x800C;&#x4E14;&#x5728;&#x6700;&#x540E;&#x5B8C;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x9AA8;&#x67B6;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#xFF0C;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x5212;&#x5206;&#x6E05;&#x6670;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x9AD8;&#x5185;&#x805A;&#xFF0C;&#x4F4E;&#x8026;&#x5408;&#x3002;</p>
<p>&#x7F16;&#x7A0B;&#x4E2D;&#x7684;&#x613F;&#x671B;&#x601D;&#x7EF4;&#x548C;&#x7ED3;&#x6784;&#x5316;&#x601D;&#x7EF4;&#x6BD4;&#x8F83;&#x7C7B;&#x4F3C;&#x3002;&#x5E26;&#x7740;&#x613F;&#x671B;&#x5199;&#x9AA8;&#x67B6;&#x4EE3;&#x7801;&#xFF0C;&#x518D;&#x63A5;&#x7740;&#x8003;&#x8651;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x6837;&#x5F88;&#x5BB9;&#x6613;&#x5F97;&#x5230;&#x826F;&#x597D;&#x7ED3;&#x6784;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x6211;&#x8FD9;&#x6B21;&#x6240;&#x4ECB;&#x7ECD;&#x7684;&#x201C;&#x613F;&#x671B;&#x601D;&#x7EF4;&#x201D;&#xFF0C;&#x548C;&#x201C;&#x7ED3;&#x6784;&#x5316;&#x201D;&#xFF0C;&#x201C;&#x6A21;&#x5757;&#x5316;&#x201D;&#xFF0C;&#x8FD8;&#x6709;&#x9EA6;&#x80AF;&#x9521;&#x7684;&#x201C;&#x91D1;&#x5B57;&#x5854;&#x539F;&#x7406;&#x201D;&#xFF0C;&#x6B8A;&#x9014;&#x540C;&#x5F52;&#xFF0C;&#x8BB2;&#x7684;&#x610F;&#x601D;&#x90FD;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x4E0D;&#x5FC5;&#x7EC6;&#x7A76;&#x5B83;&#x4EEC;&#x540D;&#x5B57;&#x4E0A;&#x7684;&#x5DEE;&#x5F02;&#x3002;</p>
<h1 id="&#x628A;&#x63E1;&#x7ED3;&#x6784;"><a href="#&#x628A;&#x63E1;&#x7ED3;&#x6784;" class="headerlink" title="&#x628A;&#x63E1;&#x7ED3;&#x6784;"></a>&#x628A;&#x63E1;&#x7ED3;&#x6784;</h1><p>&#x4E0D;&#x6B62;&#x5728;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x5DE5;&#x4F5C;&#x751F;&#x6D3B;&#x4E2D;&#x4E5F;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x613F;&#x671B;&#x601D;&#x7EF4;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5199;&#x8BBA;&#x6587;&#x6CA1;&#x601D;&#x8DEF;&#xFF0C;&#x201C;&#x4E03;&#x5929;&#x618B;&#x51FA;&#x6765;&#x516D;&#x4E2A;&#x5B57;&#x201D;&#xFF0C;&#x4E0D;&#x59A8;&#x5148;&#x628A;&#x5927;&#x7EB2;&#x5217;&#x51FA;&#xFF0C;&#x5148;&#x5217;&#x4E00;&#x7EA7;&#x6807;&#x9898;&#xFF0C;&#x628A;&#x63E1;&#x6574;&#x4E2A;&#x8BBA;&#x6587;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x5C06;&#x4E00;&#x5927;&#x5757;&#x7684;&#x6587;&#x7AE0;&#x5206;&#x89E3;&#x4E3A;&#x4E00;&#x7AE0;&#x3001;&#x4E00;&#x8282;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x7AE0;&#x3001;&#x8282;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x5206;&#x89E3;&#xFF0C;&#x4E3A;&#x6BCF;&#x4E00;&#x6BB5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x4E2D;&#x5FC3;&#x8BDD;&#x9898;&#x3002;&#x7ECF;&#x8FC7;&#x8FD9;&#x6837;&#x4E00;&#x756A;&#x5206;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x6846;&#x67B6;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x4E00;&#x4E2A;&#x4E2A;&#x5730;&#x8865;&#x5168;&#x6846;&#x67B6;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x662F;&#x4E86;&#x3002;&#x8FD8;&#x6709;&#x6BD4;&#x5982;&#x505A;&#x4E00;&#x4E2A; PPT&#xFF0C;&#x4E5F;&#x662F;&#x5148;&#x5199;&#x597D;&#x4E00;&#x4E2A;&#x201C;&#x811A;&#x672C;&#x201D;&#xFF0C;&#x5B9A;&#x4E49;&#x597D;&#x5404;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8003;&#x8651;&#x5404;&#x4E2A;&#x6A21;&#x5757;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x3002;&#x8FD9;&#x6837;&#x4E0B;&#x6765;&#xFF0C;&#x4E0D;&#x4EC5;&#x80FD;&#x4FDD;&#x8BC1;&#x603B;&#x4F53;&#x7684;&#x601D;&#x8DEF;&#x6E05;&#x6670;&#xFF0C;&#x800C;&#x4E14;&#x539F;&#x6765;&#x7684;&#x590D;&#x6742;&#x4EFB;&#x52A1;&#x5F97;&#x5230;&#x5206;&#x89E3;&#xFF0C;&#x4E5F;&#x65B9;&#x4FBF;&#x5206;&#x5E03;&#x5230;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x3001;&#x7A7A;&#x95F4;&#x5B8C;&#x6210;&#xFF08;&#x65B9;&#x4FBF;&#x4EFB;&#x52A1;&#x7BA1;&#x7406;&#xFF09;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x80FD;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x4FDD;&#x6301;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x4E00;&#x8D2F;&#x3002;</p>
<p>&#x53CD;&#x8FC7;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x89C2;&#x5BDF;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#x7684;&#x590D;&#x6742;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x63D0;&#x7EB2;&#x6308;&#x9886;&#xFF0C;&#x4ECE;&#x62BD;&#x8C61;&#x7684;&#x7ED3;&#x6784;&#x5C42;&#x6765;&#x5206;&#x6790;&#x7406;&#x89E3;&#x3002;&#x6BD4;&#x5982;&#x770B;&#x4E00;&#x672C;&#x539A;&#x539A;&#x7684;&#x7ECF;&#x5178;&#x4E66;&#xFF0C;&#x4E00;&#x4E0A;&#x624B;&#x53EF;&#x80FD;&#x89C9;&#x5F97;&#x6050;&#x60E7;&#xFF0C;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x770B;&#x4E0D;&#x5B8C;&#x8FD9;&#x4E48;&#x591A;&#x4E1C;&#x897F;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5148;&#x628A;&#x5B83;&#x7684;&#x7ED3;&#x6784;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x5728;&#x5927;&#x7684;&#x5B8F;&#x89C2;&#x89D2;&#x5EA6;&#x770B;&#x5B83;&#x662F;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5148;&#x5BF9;&#x8FD9;&#x672C;&#x4E66;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x9AA8;&#x67B6;&#x5F62;&#x5F0F;&#x7684;&#x5370;&#x8C61;&#xFF08;&#x8FD9;&#x65F6;&#x4E0D;&#x5FC5;&#x8003;&#x8651;&#x7EC6;&#x8282;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x628A;&#x6BCF;&#x4E00;&#x7AE0;&#x90FD;&#x8BFB;&#x8FC7;&#x4E86;&#x4E00;&#x6837;&#xFF09;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x6458;&#x53D6;&#x9700;&#x8981;&#x7684;&#x7AE0;&#x8282;&#x9605;&#x8BFB;&#xFF08;&#x5728;&#x9605;&#x8BFB;&#x8FD9;&#x4E9B;&#x7AE0;&#x8282;&#x7684;&#x65F6;&#x5019;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x9012;&#x5F52;&#x5730;&#x8FDB;&#x884C;&#x63D0;&#x7EB2;&#x6308;&#x9886;&#xFF0C;&#x63D0;&#x9AD8;&#x9605;&#x8BFB;&#x6548;&#x7387;&#x548C;&#x8D28;&#x91CF;&#xFF09;&#x3002;&#x518D;&#x6BD4;&#x5982;&#xFF0C;&#x5F88;&#x591A;&#x7535;&#x5F71;&#x53EF;&#x4EE5;&#x6BD4;&#x8F83;&#x660E;&#x663E;&#x5730;&#x770B;&#x51FA;&#x5BFC;&#x6F14;&#x5B9E;&#x73B0;&#x6574;&#x4E2A;&#x7535;&#x5F71;&#x65F6;&#x7684;&#x7ED3;&#x6784;&#x8BBE;&#x8BA1;&#xFF0C;&#x89C2;&#x770B;&#x8FD9;&#x79CD;&#x7535;&#x5F71;&#x7684;&#x4E50;&#x8DA3;&#x4E0D;&#x4EC5;&#x5728;&#x4E8E;&#x5177;&#x4F53;&#x67D0;&#x4E00;&#x4E2A;&#x6865;&#x6BB5;&#x3001;&#x573A;&#x666F;&#x3001;&#x53F0;&#x8BCD;&#xFF0C;&#x4E5F;&#x5728;&#x4E8E;&#x6574;&#x4E2A;&#x7ED3;&#x6784;&#x7684;&#x5DE7;&#x5999;&#x5B89;&#x6392;&#xFF08;&#x8FD9;&#x65B9;&#x9762;&#x4E00;&#x4E2A;&#x8457;&#x540D;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x602A;&#x624D;&#x6606;&#x6C40;&#x5854;&#x4ED1;&#x8482;&#x8BFA;&#x7684;&#x7535;&#x5F71;&#x300A;&#x4F4E;&#x4FD7;&#x5C0F;&#x8BF4;&#x300B;&#xFF09;&#x3002;</p>
<h1 id="&#x66F4;&#x591A;&#x9605;&#x8BFB;"><a href="#&#x66F4;&#x591A;&#x9605;&#x8BFB;&#xFF1A;" class="headerlink" title="&#x66F4;&#x591A;&#x9605;&#x8BFB;&#xFF1A;"></a>&#x66F4;&#x591A;&#x9605;&#x8BFB;&#xFF1A;</h1><hr>
<ul>
<li><a href="http://rhodesmill.org/brandon/slides/2014-07-pyohio/clean-architecture/" target="_blank" rel="external">The Clean Architecture in Python by Brandon Rhodes</a></li>
<li><a href="https://book.douban.com/subject/4882120/" target="_blank" rel="external">&#x300A;&#x91D1;&#x5B57;&#x5854;&#x539F;&#x7406;&#x300B;</a></li>
</ul>
<h1 id="&#x7248;&#x6743;&#x58F0;&#x660E;"><a href="#&#x7248;&#x6743;&#x58F0;&#x660E;&#xFF1A;" class="headerlink" title="&#x7248;&#x6743;&#x58F0;&#x660E;&#xFF1A;"></a>&#x7248;&#x6743;&#x58F0;&#x660E;&#xFF1A;</h1><hr>
<p>&#x672C;&#x6587;&#x4E2D;&#x6240;&#x6709;&#x6587;&#x5B57;&#x3001;&#x56FE;&#x7247;&#x7248;&#x6743;&#x5747;&#x5C5E;&#x672C;&#x4EBA;&#x6240;&#x6709;&#xFF0C;&#x5982;&#x9700;&#x8F6C;&#x8F7D;&#x8BF7;&#x6CE8;&#x660E;&#x6765;&#x6E90;&#x3002;</p>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/编程/" rel="tag">#编程</a>
          
            <a href="/tags/重构/" rel="tag">#重构</a>
          
            <a href="/tags/代码结构/" rel="tag">#代码结构</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/06/22/linear-algebra-5/" rel="next" title="线性代数拾遗（五）：矩阵变换的应用">
                <i class="fa fa-chevron-left"></i> 线性代数拾遗（五）：矩阵变换的应用
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/07/01/linear-algebra-6/" rel="prev" title="线性代数拾遗（六）：特征值与特征向量">
                线性代数拾遗（六）：特征值与特征向量 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/06/23/wishful-thinking/"
           data-title="愿望思维" data-url="http://mengqi92.github.io/2016/06/23/wishful-thinking/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/avatar/avatar.png"
               alt="Mengqi" />
          <p class="site-author-name" itemprop="name">Mengqi</p>
          <p class="site-description motion-element" itemprop="description">机器学习、图像处理、统计分析、函数式编程</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">13</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">6</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">33</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/mengqi92" target="_blank" title="github">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  github
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://twitter.com/mengqipei" target="_blank" title="twitter">
                  
                    <i class="fa fa-fw fa-twitter"></i>
                  
                  twitter
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="mailto:mengqipei@gmail.com" target="_blank" title="email">
                  
                    <i class="fa fa-fw fa-envelope"></i>
                  
                  email
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/u/2264422383" target="_blank" title="weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  weibo
                </a>
              </span>
            
          
        </div>

        
        
          <div class="cc-license motion-element" itemprop="license">
            <a href="http://creativecommons.org/licenses/by-nc/4.0" class="cc-opacity" target="_blank">
              <img src="/images/cc-by-nc.svg" alt="Creative Commons" />
            </a>
          </div>
        

        
        
          <div class="links-of-blogroll motion-element links-of-blogroll-block">
            <div class="links-of-blogroll-title">
              <i class="fa  fa-fw fa-globe"></i>
              友情链接
            </div>
            <ul class="links-of-blogroll-list">
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.fuzihao.org" title="切问录" target="_blank">切问录</a>
                </li>
              
            </ul>
          </div>
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#复杂度"><span class="nav-number">1.</span> <span class="nav-text">复杂度</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#愿望思维"><span class="nav-number">2.</span> <span class="nav-text">愿望思维</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#把握结构"><span class="nav-number">3.</span> <span class="nav-text">把握结构</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#更多阅读"><span class="nav-number">4.</span> <span class="nav-text">更多阅读：</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#版权声明"><span class="nav-number">5.</span> <span class="nav-text">版权声明：</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2015 - 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Mengqi</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

<div class="busuanzi-count">

  <script async src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js"></script>

  
    <span class="site-uv"><i class="fa fa-user"></i> 本站访客数<span class="busuanzi-value" id="busuanzi_value_site_uv"></span>人次</span>
  

  
    <span class="site-pv"><i class="fa fa-eye"></i> 总访问量<span class="busuanzi-value" id="busuanzi_value_site_pv"></span>次</span>
  
  
</div>



        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"mengqipei"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
      
      <script src="/vendors/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
      <script src="/js/src/hook-duoshuo.js"></script>
    
  






  
  
  

  

  
<script type="text/javascript" async src="//push.zhanzhang.baidu.com/push.js">
</script><!-- hexo-inject:begin --><!-- hexo-inject:end -->


</body>
</html>
